---
kind: property
id: P:Autodesk.Revit.DB.IFC.IFCData.PrimitiveType
source: html/1b9d23db-b700-1f02-e02e-77ac73e7d667.htm
---
# Autodesk.Revit.DB.IFC.IFCData.PrimitiveType Property

The primitive data type.

## Syntax (C#)
```csharp
public IFCDataPrimitiveType PrimitiveType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration